---
title: AnalyticalDistributionNodePropertyData
classe: Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# AnalyticalDistributionNodePropertyData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElectricalConnectedPhases ConnectedPhases { get; }` | `analyticalDistributionNodePropertyData.ConnectedPhases` | ElectricalConnectedPhases |
| `Boolean IsValidObject { get; }` | `analyticalDistributionNodePropertyData.IsValidObject` | Boolean |
| `Int32 NumberOfPhases { get; }` | `analyticalDistributionNodePropertyData.NumberOfPhases` | Int32 |
| `Void Dispose()` | `analyticalDistributionNodePropertyData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```